Revit 2026 API

# DirectContext3DDocumentUtilsIsADirectContext3DHandleInstance Method

---

Checks whether the provided Element ID corresponds to a DirectContext3D handle instance element.

**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool IsADirectContext3DHandleInstance(
	Document aDocument,
	ElementId elementId
)
```
```vb
Public Shared Function IsADirectContext3DHandleInstance (
	aDocument As Document,
	elementId As ElementId
) As Boolean
```
```cpp
public:
static bool IsADirectContext3DHandleInstance(
	Document^ aDocument,
	ElementId^ elementId
)
```
```fsharp
static member IsADirectContext3DHandleInstance :
        aDocument : Document *
        elementId : ElementId -> bool
```

#### Parameters

aDocument Document
     The document.
elementId ElementId
     The ID of the element to check.

#### Return Value

Boolean True, if the element is a valid DirectContext3D handle instance, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentException | aDocument is not a project document. -or- elementId is not a valid Element identifier. |
| ArgumentNullException | A non-optional argument was null |

DirectContext3D handle instances are DirectShapes.

#### Reference

DirectContext3DDocumentUtils Class

Autodesk.Revit.DB.DirectContext3D Namespace